backend/controllers/ArticleController.php

    public function actionAdd()
    {
        //实列化对象
        $model = new Article();
        //实列化分类对象 查询分类asArray():将对象转为数组
        $article_category = Article_category::find()->where(['status'=>1])->asArray()->all();
---
SELECT * FROM `article_category` WHERE `status`=1