backend/controllers/GoodsController.php

            return $this->redirect(['goods/index']);
        }

        $goodsCategory = GoodsCategory::find()->asArray()->all();//商品分类
        $brand = Brand::find()->all();
---
SELECT * FROM `goods_category`
SELECT * FROM `brand`