backend/controllers/UserController.php

SELECT * FROM `User`
---
    public function actionIndex()
    {

//        var_dump(\Yii::$app->user->isGuest);exit;
        $model = User::find()->all();