frontend/controllers/IndexController.php

    public function actionIndex()
    {
        $goodsCategory = GoodsCategory::find()->where(['parent_id' => 0])->all();
---
SELECT * FROM `goods_category` WHERE `parent_id`=0

    public function actionList($cate_id)
    {
        $goodsCategory = GoodsCategory::find()->where(['parent_id' => 0])->all();
        $goods = Goods::find()->where(['goods_category_id' => $cate_id])->all();
---
SELECT * FROM `goods_category` WHERE `parent_id`=0
SELECT * FROM `goods` WHERE `goods_category_id`='8'

    public function actionGoodsIntro($id)
    {
//        $goodsCategory=GoodsCategory::find()->where(['parent_id'=>0])->all();
        //实列化
        $goods = Goods::findOne($id);//商品表
        $goodsCategory = GoodsCategory::findOne(['id' => $goods->goods_category_id]);//商品分类表
        $brand = Brand::findOne(['id' => $goods->brand_id]);//品牌表
        $goodsIntro = GoodsIntro::findOne(['goods_id' => $goods->id]);//商品详情表
        $goods_photo = GoodsPhoto::findAll(['goods_id' => $id]);
---
SELECT * FROM `goods` WHERE `id`='1'
SELECT * FROM `goods_category` WHERE `id`=8
SELECT * FROM `brand` WHERE `id`=9
SELECT * FROM `goods_intro` WHERE `goods_id`='1'
SELECT * FROM `goods_photo` WHERE `goods_id`='1'

    public function actionAdd()
    {

        $goods_id = \Yii::$app->request->post('goods_id');
        var_dump($goods_id);
        $amount = \Yii::$app->request->post('amount');
        $goods = Goods::findOne(['id' => $goods_id]);
---
SELECT * FROM `goods` WHERE `id`='1'

    public function actionCart()
    {

        //判断是否是游客 是->在cookie中取出购物车信息
        if (\Yii::$app->user->isGuest) {
            //获取cookie中的商品数据和id
            $cookies = \Yii::$app->request->cookies;
            $cookie = $cookies->get(('cart'));
            if ($cookie == null) {
                //无记录
                //当 用户购物车中没有记录就 跳转到首页
                return $this->redirect('index.html');
            } else {
                //存在数据  就将已序列化的数据 反序列化
                $cart = unserialize($cookie->value);
            };
            $models = [];
            foreach ($cart as $goods_id => $amount) {

                $goods = Goods::findOne(['id' => $goods_id])->attributes;
---
SELECT * FROM `goods` WHERE `id`=1

    public function actionUpdateCart()
    {
        $goods_id = \Yii::$app->request->post('goods_id');
        $amount = \Yii::$app->request->post('amount');
        $goods = Goods::findOne(['id' => $goods_id]);
---
SELECT * FROM `goods` WHERE `id`='1'