frontend/controllers/OrderController.php

SELECT * FROM `cart` WHERE `member_id`=20
SELECT * FROM `address` WHERE `member_id`=20
---
    public function actionIndex()
    {
        if(\Yii::$app->user->isGuest){//未登录状态点击结算将 调回登陆首页
            //附带当前地址参数 登陆后根据这个地址跳转会回来
            return $this->redirect(['user/login','url'=>'/order/index.html']);
        }
        $user_id = \Yii::$app->user->id;
        //定义送货方式填入数组  在页面进行遍历
        $deliveryMode = [
            ['普通快递送货上门', 10.00, '每张订单不满499.00元,运费15.00元'],
            ['特快专递', 40.00, '每张订单不满499.00元,运费40.00元'],
            ['加急快递送货上门', 40.00, '每张订单不满499.00元,运费40.00元'],
            ['平邮', 10.00, '每张订单不满499.00元,运费15.00元'],
        ];
        //定义支付方式:
        $paymentMethod = [
            ['货到付款', '送货上门后再收款，支持现金、POS机刷卡、支票支付'],
            ['在线支付', '即时到帐，支持绝大数银行借记卡及部分银行信用卡'],
            ['上门自提', '自提时付款，支持现金、POS刷卡、支票支付'],
            ['邮局汇款', '通过快钱平台收款 汇款后1-3个工作日到账']
        ];
              //购物车中的数据
        $carts = Cart::find()->where(['member_id' => \Yii::$app->user->id])->all();

        if (\Yii::$app->request->post()) {

            $data = \Yii::$app->request->post();
            //配送地址详细信息
            $address = Address::findOne(['member_id' => $user_id]);

INSERT INTO `order` (`member_id`, `name`, `province`, `city`, `area`, `address`, `tel`, `delivery_id`, `delivery_name`, `delivery_price`, `payment_id`, `payment_name`, `total`, `status`, `trade_no`, `create_time`) VALUES (20, '徐茂', '湖南', '株洲', '石峰区', '永城市高新区 天府新谷5号楼', '12345678941', 1, '加急快递送货上门', '40', 1, '上门自提', '4550', 2, '201707041040345301', 1499164834)
---
            //创建事物
            $transaction=\Yii::$app->db->beginTransaction();
            try{
                $r=$order->save();

SELECT * FROM `goods` WHERE `id`=12
---
                    $orderGoods = new OrderGoods();
                    $order_id=$order->id;
                    foreach ($carts as $cart) {//遍历购物车找出 购物车中商品id对应的goods表中的商品,
                        $goods = Goods::find()->asArray()->where(['id' => $cart->goods_id])->all();

INSERT INTO `order_goods` (`goods_id`, `goods_name`, `logo`, `amount`, `total`) VALUES (12, '乐视超级电视 超4 X40 40英寸 H', 'http://or9rkj4hb.bkt.clouddn.com//upload/d4/9a/d49af4a958759482984ffa7a2f44badd8408263a.jpg', 10, '4550')
UPDATE `order_goods` SET `order_id`=63 WHERE `id`=37
---
                        }
                        $orderGoods->amount = $cart->amount;//    '数量',
                        $orderGoods->total =$cart->amount * $goods[0]['shop_price'];//     小计',
                        $orderGoods->insert();
                        $orderGoods->order_id = $order_id; //> '订单id',
                        $orderGoods->save();

SELECT * FROM `address` WHERE `member_id`=20
---

        } else {
            //送货地址
            $address = Address::find()->where(['member_id' => $user_id])->all();