frontend/controllers/UserController.php

INSERT INTO `member` (`username`, `password_hash`, `email`, `tel`, `last_login_time`, `updated_at`, `created_at`, `last_login_ip`, `auth_key`, `status`) VALUES ('12344', '$2y$13$axE3GE.KU6WrLWrjT8TXpubH4NRM5xu6kg2oWjymxpHFwoMObl.FW', '1344@aaa.com', '15808479339', 1499165360, 1499165360, 1499165360, 2130706433, 'f2kj0dl7EesObZ25EbA7Bq42BRIw_FCT', 1)
SELECT * FROM `member` WHERE `id`=28
---
    public function actionRegister()
    {

        $model = new Member(['scenario'=>member::SCENARIO_REGISTER]);
//        var_dump(\Yii::$app->request->post());exit;

        if ($model->load(\Yii::$app->request->post()) && $model->validate()) {
            //保存之前自动调用模型中的beforeSaxe方法;;
            if ($model->save(false)) {//save保存之前不用验证已验证码,因为在validate()已经验证过了
                //提示 跳转
                $user = Member::findOne(['id' => $model->getId()]);

SELECT * FROM `member` WHERE `id`='20'
---
    public function actionUserEdit($id)
    {
        $model = Member::findOne(['id' => $id]);

SELECT * FROM `cart` WHERE `goods_id`=1
UPDATE `cart` SET `amount`=17 WHERE `id`='17'
---
    public function actionLogin()
    {
        $model = new \frontend\models\LoginForm();
        if ($model->load(\Yii::$app->request->post()) && $model->validate()) {
            if ($model->UserLogin()) {//调用login方法
                //登陆成功 检查cookie中的购物车信息
                $user = \Yii::$app->user->id;//获取用户id
                //查看cookie中是否有购物车的数据
                $cookies = \Yii::$app->request->cookies;
                $cookie = $cookies->get('cart');//查询cookie中 购物车的数据
                if ($cookie != null) {
                    $cart[] = unserialize($cookie->value);//将存入cookie中的序列化数据反序列化出来
                    foreach ($cart as $oneCart) {//遍历数组 得到的是每一个商品ID为键 商品数量为键值的数组
                        foreach (array_keys($oneCart) as $key) {//取出所有数组中的键位(商品id)组成一个新数组, 遍历出每一个商品id
                            //判断当前用户是否拥有该商品记录
                            $userCartDate = Cart::findOne(['goods_id' => $key]);//再通过查询每个商品在购物车数据表中是否存在
                            if ($userCartDate == null) {//不存在记录 添加在数据
                                $cart = new Cart();
                                //调用模型中的方法
                                $cart->insertCartData($user, $key, $oneCart[$key]);
                                /*  $cart->member_id = $user;
                                  $cart->goods_id = intval($key);
                                  $cart->amount = $oneCart[$key];
                                  $cart->save();*/
                            } else { //存在 更新购物车中商品的购买数量
                                $userCartDate->amount += intval($oneCart[$key]);
                                $userCartDate->update();