backend/models/LoginForm.php

    public function login()
    {
        //根据用户名查找用户
        $model = User::findOne(['username' => $this->username]);
---
SELECT * FROM `User` WHERE `username`='123'