backend/widgets/MenuWidgets.php

    public  function run()
    {
        NavBar::begin([
            'brandLabel' => '后台管理系统',
            'brandUrl' => \Yii::$app->homeUrl,
            'options' => [
                'class' => 'navbar-inverse navbar-fixed-top',
            ],
        ]);
        $menuItems = [
            ['label' => '首页', 'url' => ['/article/index']],
        ];
        if (Yii::$app->user->isGuest) {
            $menuItems[] = ['label' => '请登陆', 'url' => Yii::$app->user->loginUrl];
        } else {
            $menuItems[] = ['label'=>'注销('.Yii::$app->user->identity->username.')','url'=>['user/login-out']];
        }
       /* $menuItems[] = ['label'=>'用户管理','items'=>[
            ['label'=>'添加用户','url'=>['admin/add']],
            ['label'=>'用户列表','url'=>['admin/index']]
        ]];*/
       $menus=Menu::find()->where(['parent_id'=>0])->all();
---
SELECT * FROM `menu` WHERE `parent_id`=0