frontend/models/LoginForm.php

SELECT * FROM `member` WHERE `username`='123'
---
    public function UserLogin()
    {
        //根据用户名查找用户
        $model = Member::findOne(['username' => $this->username]);