frontend/models/Member.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `member` WHERE `id`=20